shubhamdp/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
        // Otherwise, ensure WiFi station mode is disabled.
        else
        {
            // ReturnErrorOnFailure(SetWiFiStationMode(kWiFiStationMode_Disabled));
        }
    }

    // Force AP mode off for now.
    // @shubham: This sets mode to STA again, why is this required?
    // ReturnErrorOnFailure(Internal::ESP32Utils::SetAPMode(false));

    // Queue work items to bootstrap the AP and station state machines once the Chip event loop is running.
    ReturnErrorOnFailure(DeviceLayer::SystemLayer().ScheduleWork(DriveStationState, NULL));

#if CHIP_DEVICE_CONFIG_ENABLE_WIFI_AP
    ReturnErrorOnFailure(DeviceLayer::SystemLayer().ScheduleWork(DriveAPState, NULL));
#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFI_AP

    return CHIP_NO_ERROR;
}

#if CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

namespace {
#pragma pack(push, 1)
struct PAFPublishSSI
{
    uint8_t DevOpCode;
    uint16_t DevInfo;
    uint16_t ProductId;
    uint16_t VendorId;
};

CHIP_ERROR ConstructSSI(PAFPublishSSI & ssi)
{
    ssi.DevOpCode = 0x00;
    ReturnErrorOnFailure(GetCommissionableDataProvider()->GetSetupDiscriminator(ssi.DevInfo));
    ReturnErrorOnFailure(GetDeviceInstanceInfoProvider()->GetProductId(ssi.ProductId));
    ReturnErrorOnFailure(GetDeviceInstanceInfoProvider()->GetVendorId(ssi.VendorId));
    return CHIP_NO_ERROR;
}

bool gTransportInitiated = false;

} // namespace

static CHIP_ERROR InitiateTransport(const wifi_event_nan_receive_t & event)
{
    if (gTransportInitiated)
    {
        ChipLogError(DeviceLayer, "connectivitymanagerimpl_wifi -- InitiateTransport, transport already initiated");
        return CHIP_NO_ERROR;
    }

    // populate tx info
    WiFiPAF::WiFiPAFSession TxInfo;
    TxInfo.id      = static_cast<uint32_t>(event.inst_id);
    TxInfo.peer_id = static_cast<uint32_t>(event.peer_inst_id);
    memcpy(TxInfo.peer_addr, event.peer_if_mac, sizeof(TxInfo.peer_addr));
    DeviceLayer::GetCommissionableDataProvider()->GetSetupDiscriminator(TxInfo.discriminator);
    TxInfo.role = WiFiPAF::WiFiPafRole::kWiFiPafRole_Publisher;

    WiFiPAFSession sessionInfo  = { .id = TxInfo.id };
    WiFiPAFLayer & WiFiPafLayer = WiFiPAFLayer::GetWiFiPAFLayer();
    auto pPafInfo               = WiFiPafLayer.GetPAFInfo(PafInfoAccess::kAccSessionId, sessionInfo);
    if (pPafInfo == nullptr)
    {
        ChipLogError(DeviceLayer, "connectivitymanagerimpl_wifi -- InitiateTransport, no valid session with publish_id: %" PRIu32,
                     TxInfo.id);
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    if ((pPafInfo->role == WiFiPAF::WiFiPafRole::kWiFiPafRole_Publisher) && (pPafInfo->peer_id == TxInfo.peer_id) &&
        !memcmp(pPafInfo->peer_addr, TxInfo.peer_addr, sizeof(uint8_t) * 6))
    {
        ChipLogError(DeviceLayer, "connectivitymanagerimpl_wifi -- InitiateTransport, reentrance, publish_id: %" PRIu32, TxInfo.id);
        return CHIP_ERROR_INCORRECT_STATE;
    }

    ChipLogProgress(DeviceLayer, "WiFi-PAF: InitiateTransport, set PafInfo, whose nodeId: 0x" ChipLogFormatX64,
                    ChipLogValueX64(pPafInfo->nodeId));
    ChipLogProgress(DeviceLayer, "\t (publish_id, peer_subscribe_id): (%" PRIu32 ", %" PRIu32 ")", TxInfo.id, TxInfo.peer_id);
    ChipLogProgress(DeviceLayer, "\t peer_addr: [%02x:%02x:%02x:%02x:%02x:%02x]", TxInfo.peer_addr[0], TxInfo.peer_addr[1],
                    TxInfo.peer_addr[2], TxInfo.peer_addr[3], TxInfo.peer_addr[4], TxInfo.peer_addr[5]);
    // ChipLogProgress(DeviceLayer, "\t DevInfo: %x", pPublishSSI->DevInfo);

    pPafInfo->role    = WiFiPAF::WiFiPafRole::kWiFiPafRole_Publisher;
    pPafInfo->id      = TxInfo.id;
    pPafInfo->peer_id = TxInfo.peer_id;
    memcpy(pPafInfo->peer_addr, TxInfo.peer_addr, sizeof(uint8_t) * 6);

    CHIP_ERROR err = WiFiPafLayer.HandleTransportConnectionInitiated(*pPafInfo);
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "InitiateTransport, HandleTransportConnectionInitiated() failed: %s", chip::ErrorStr(err));
    }

    gTransportInitiated = true;
    printf("InitiateTransport, done\n");
    return CHIP_NO_ERROR;
}

void ConnectivityManagerImpl::OnNanReceive(const wifi_event_nan_receive_t & event, uint8_t * ssi)
{
    printf("connectivitymanagerimpl_wifi -- OnNanReceive\n");
    // populate rx info
    WiFiPAF::WiFiPAFSession RxInfo;
    RxInfo.id      = static_cast<uint32_t>(event.inst_id);
    RxInfo.peer_id = static_cast<uint32_t>(event.peer_inst_id);
    memcpy(RxInfo.peer_addr, event.peer_if_mac, sizeof(RxInfo.peer_addr));
    RxInfo.role = WiFiPAF::WiFiPafRole::kWiFiPafRole_Subscriber;

    // since we do not get the nanreplied event, we need to initiate the transport here
    if (InitiateTransport(event) == CHIP_NO_ERROR)
    {
        printf("connectivitymanagerimpl_wifi -- OnNanReceive, InitiateTransport done\n");
    }
    else
    {
        printf("connectivitymanagerimpl_wifi -- OnNanReceive, InitiateTransport failed\n");
    }
    // printf("connectivitymanagerimpl_wifi -- OnNanReceive, ssi_len: %u, ssi: \n  ", event.ssi_len);
    // for (uint8_t i = 0; i < event.ssi_len; i++)
    // {
    //     printf("%02X ", ssi[i]);
    // }
    // printf("\n");

    // construct packet buffer
    System::PacketBufferHandle pbuf = System::PacketBufferHandle::NewWithData(ssi + 4, event.ssi_len - 4);
    bool status                     = WiFiPAF::WiFiPAFLayer::GetWiFiPAFLayer().OnWiFiPAFMessageReceived(RxInfo, std::move(pbuf));
    if (status)
    {
        printf("OnWiFiPAFMessageReceived returned true\n");
    }
    else
    {
        printf("OnWiFiPAFMessageReceived returned false\n");
    }

    // free ssi
    if (ssi)
    {
        Platform::MemoryFree(ssi);
        ssi = nullptr;
    }
}

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

void ConnectivityManagerImpl::OnWiFiPlatformEvent(const ChipDeviceEvent * event)
{
    if (event->Type == DeviceEventType::kESPSystemEvent)
    {
        if (event->Platform.ESPSystemEvent.Base == WIFI_EVENT)
        {
            switch (event->Platform.ESPSystemEvent.Id)
            {
            case WIFI_EVENT_SCAN_DONE:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_SCAN_DONE");
                NetworkCommissioning::ESPWiFiDriver::GetInstance().OnScanWiFiNetworkDone();
                break;
            case WIFI_EVENT_STA_START:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_START");
                // DriveStationState();
                break;
            case WIFI_EVENT_STA_CONNECTED:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_CONNECTED");
                if (mWiFiStationState == kWiFiStationState_Connecting)
                {
                    ChangeWiFiStationState(kWiFiStationState_Connecting_Succeeded);
                }
                DriveStationState();
                break;
            case WIFI_EVENT_STA_DISCONNECTED:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_DISCONNECTED");
                NetworkCommissioning::ESPWiFiDriver::GetInstance().SetLastDisconnectReason(event);
                if (mWiFiStationState == kWiFiStationState_Connecting)
                {
                    ChangeWiFiStationState(kWiFiStationState_Connecting_Failed);
                }
                DriveStationState();
                break;
            case WIFI_EVENT_STA_STOP:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_STOP");
                DriveStationState();
                break;
#if CHIP_DEVICE_CONFIG_ENABLE_WIFI_AP
            case WIFI_EVENT_AP_START:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_AP_START");
                ChangeWiFiAPState(kWiFiAPState_Active);
                DriveAPState();
                break;
            case WIFI_EVENT_AP_STOP:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_AP_STOP");
                ChangeWiFiAPState(kWiFiAPState_NotActive);
                DriveAPState();
                break;
            case WIFI_EVENT_AP_STACONNECTED:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_AP_STACONNECTED");
                MaintainOnDemandWiFiAP();
                break;
#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFI_AP

#if CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF
            case WIFI_EVENT_NAN_RECEIVE: {
                ChipLogProgress(DeviceLayer, "connectivitymanagerimpl_wifi -- got an event WIFI_EVENT_NAN_RECEIVE");
                OnNanReceive(event->Platform.ESPSystemEvent.Data.WiFiNanReceive.nanReceive,
                             event->Platform.ESPSystemEvent.Data.WiFiNanReceive.ssi);
                break;
            }
#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

            default:
                break;
            }
        }

        if (event->Platform.ESPSystemEvent.Base == IP_EVENT)
        {
            switch (event->Platform.ESPSystemEvent.Id)
            {
            case IP_EVENT_STA_GOT_IP:
                ChipLogProgress(DeviceLayer, "IP_EVENT_STA_GOT_IP");
                OnStationIPv4AddressAvailable(event->Platform.ESPSystemEvent.Data.IpGotIp);
                break;
            case IP_EVENT_STA_LOST_IP:
                ChipLogProgress(DeviceLayer, "IP_EVENT_STA_LOST_IP");
                OnStationIPv4AddressLost();
                break;
            case IP_EVENT_GOT_IP6:
                ChipLogProgress(DeviceLayer, "IP_EVENT_GOT_IP6");
                if (strcmp(esp_netif_get_ifkey(event->Platform.ESPSystemEvent.Data.IpGotIp6.esp_netif),
                           ESP32Utils::kDefaultWiFiStationNetifKey) == 0)
                {
                    OnStationIPv6AddressAvailable(event->Platform.ESPSystemEvent.Data.IpGotIp6);
                }
                break;
            default:
                break;
            }
        }
    }
    if (event->Type == DeviceEventType::kCHIPoWiFiPAFWriteDone)
    {
        ChipLogProgress(DeviceLayer, "WiFi-PAF: event: kCHIPoWiFiPAFWriteDone, result: %d", event->CHIPoWiFiPAFReceived.result);
        WiFiPAF::WiFiPAFSession TxInfo;
        memcpy(&TxInfo, &event->CHIPoWiFiPAFReceived.SessionInfo, sizeof(WiFiPAF::WiFiPAFSession));
        CHIP_ERROR err = WiFiPAF::WiFiPAFLayer::GetWiFiPAFLayer().HandleWriteConfirmed(TxInfo, event->CHIPoWiFiPAFReceived.result);
        if (err != CHIP_NO_ERROR)
        {
            ChipLogError(DeviceLayer, "HandleWriteConfirmed() failed: %s", chip::ErrorStr(err));
        }
    }
}

void ConnectivityManagerImpl::_OnWiFiScanDone()
{
    // Schedule a call to DriveStationState method in case a station connect attempt was
    // deferred because the scan was in progress.
    DeviceLayer::SystemLayer().ScheduleWork(DriveStationState, NULL);
}

void ConnectivityManagerImpl::_OnWiFiStationProvisionChange()
{
    // Schedule a call to the DriveStationState method to adjust the station state as needed.
    DeviceLayer::SystemLayer().ScheduleWork(DriveStationState, NULL);
}

void ConnectivityManagerImpl::DriveStationState()
{
    bool stationConnected;

    // Refresh the current station mode.  Specifically, this reads the ESP auto_connect flag,
    // which determine whether the WiFi station mode is kWiFiStationMode_Enabled or
    // kWiFiStationMode_Disabled.
    GetWiFiStationMode();

