shubhamdp/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
        // Alert other components of the state change.
        ChipDeviceEvent event;
        event.Type                                 = DeviceEventType::kInternetConnectivityChange;
        event.InternetConnectivityChange.IPv4      = GetConnectivityChange(hadIPv4Conn, haveIPv4Conn);
        event.InternetConnectivityChange.IPv6      = GetConnectivityChange(hadIPv6Conn, haveIPv6Conn);
        event.InternetConnectivityChange.ipAddress = addr;

        PlatformMgr().PostEventOrDie(&event);

        if (haveIPv4Conn != hadIPv4Conn)
        {
            ChipLogProgress(DeviceLayer, "%s Internet connectivity %s", "IPv4", (haveIPv4Conn) ? "ESTABLISHED" : "LOST");
        }

        if (haveIPv6Conn != hadIPv6Conn)
        {
            ChipLogProgress(DeviceLayer, "%s Internet connectivity %s", "IPv6", (haveIPv6Conn) ? "ESTABLISHED" : "LOST");
        }
    }
}

void ConnectivityManagerImpl::OnStationIPv4AddressAvailable(const ip_event_got_ip_t & got_ip)
{
#if CHIP_PROGRESS_LOGGING
    {
        ChipLogProgress(DeviceLayer, "IPv4 address %s on WiFi station interface: " IPSTR "/" IPSTR " gateway " IPSTR,
                        (got_ip.ip_changed) ? "changed" : "ready", IP2STR(&got_ip.ip_info.ip), IP2STR(&got_ip.ip_info.netmask),
                        IP2STR(&got_ip.ip_info.gw));
    }
#endif // CHIP_PROGRESS_LOGGING

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Assigned;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv4AddressLost(void)
{
    ChipLogProgress(DeviceLayer, "IPv4 address lost on WiFi station interface");

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Lost;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv6AddressAvailable(const ip_event_got_ip6_t & got_ip)
{
#if CHIP_PROGRESS_LOGGING
    {
        ChipLogProgress(DeviceLayer, "IPv6 addr available. Ready on %s interface: " IPV6STR, esp_netif_get_ifkey(got_ip.esp_netif),
                        IPV62STR(got_ip.ip6_info.ip));
    }
#endif // CHIP_PROGRESS_LOGGING

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV6_Assigned;
    PlatformMgr().PostEventOrDie(&event);

#ifdef CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER
    uint8_t station_mac[6];
    if (esp_wifi_get_mac(WIFI_IF_STA, station_mac) == ESP_OK)
    {
        static chip::Inet::ESP32EndpointQueueFilter sEndpointQueueFilter;
        char station_mac_str[12];
        for (size_t i = 0; i < 6; ++i)
        {
            uint8_t dig1               = (station_mac[i] & 0xF0) >> 4;
            uint8_t dig2               = station_mac[i] & 0x0F;
            station_mac_str[2 * i]     = static_cast<char>(dig1 > 9 ? ('A' + dig1 - 0xA) : ('0' + dig1));
            station_mac_str[2 * i + 1] = static_cast<char>(dig2 > 9 ? ('A' + dig2 - 0xA) : ('0' + dig2));
        }
        if (sEndpointQueueFilter.SetMdnsHostName(chip::CharSpan(station_mac_str)) == CHIP_NO_ERROR)
        {
            chip::Inet::UDPEndPointImpl::SetQueueFilter(&sEndpointQueueFilter);
        }
        else
        {
            ChipLogError(DeviceLayer, "Failed to set mDNS hostname for endpoint queue filter");
        }
    }
    else
    {
        ChipLogError(DeviceLayer, "Failed to get the MAC address of station netif");
    }
#endif // CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER

#ifdef CONFIG_ENABLE_ROUTE_HOOK
    esp_route_hook_init(esp_netif_get_handle_from_ifkey(ESP32Utils::kDefaultWiFiStationNetifKey));
#endif
}

#if CHIP_CONFIG_ENABLE_ICD_SERVER

CHIP_ERROR ConnectivityManagerImpl::_SetPollingInterval(System::Clock::Milliseconds32 pollingInterval)
{
    (void) pollingInterval;
    // For ESP32 platform, the listen interval of the legacy power-saving mode can only be configured before connecting to AP.
    return CHIP_ERROR_NOT_IMPLEMENTED;
}
#endif // CHIP_CONFIG_ENABLE_ICD_SERVER

#if CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFPublish(WiFiPAFAdvertiseParam & args)
{
    // Service name
    const char * kServiceName = "_matterc._udp";

    // TODO: args.freq_list and args.freq_list_len should be used to set channel list

    // Default channel if no frequency list is provided
    uint8_t chan_list[]   = {6} ;
    uint8_t chan_list_len = sizeof(chan_list);

    static uint8_t static_ssi[] = { 0x00, 0x00, 0x0F, 0x00, 0x01, 0x80, 0xF1, 0xFF };
    // Construct the WFA SSI structure for Matter
    // WFA OUI is 0x50, 0x6F, 0x9A
    // Format: [WFA OUI (3 bytes)] + [Protocol (1 byte)] + [Payload]

    // First prepare the Matter-specific payload
    // static PAFPublishSSI payloadSsi;
    // ReturnErrorOnFailure(ConstructSSI(payloadSsi));

    // Calculate total size needed for WFA SSI (OUI + protocol + payload)
    size_t wfaSsiSize = 3 + 1 + sizeof(static_ssi);

    // Allocate memory for the complete WFA SSI
    uint8_t * completeWfaSsi = static_cast<uint8_t *>(chip::Platform::MemoryAlloc(wfaSsiSize));
    VerifyOrReturnError(completeWfaSsi != nullptr, CHIP_ERROR_NO_MEMORY);

    // Fill in the WFA OUI
    completeWfaSsi[0] = 0x50;
    completeWfaSsi[1] = 0x6F;
    completeWfaSsi[2] = 0x9A;
    // Set the protocol type to CSA MATTER
    completeWfaSsi[3] = WIFI_SVC_PROTO_CSA_MATTER;

    // Copy the payload
    memcpy(completeWfaSsi + 4, &static_ssi, sizeof(static_ssi));

    printf("Constructed WFA SSI with Matter protocol:\n  ");
    for (size_t i = 0; i < wfaSsiSize; i++)
    {
        printf("%02X ", completeWfaSsi[i]);
    }
    printf("\n");

    wifi_nan_publish_cfg_t nanPublishConfig = { 0 };

    strlcpy(nanPublishConfig.service_name, kServiceName, sizeof(nanPublishConfig.service_name));
    nanPublishConfig.type               = static_cast<wifi_nan_service_type_t>(NAN_PUBLISH_UNSOLICITED | NAN_PUBLISH_SOLICITED);
    nanPublishConfig.ssi                = reinterpret_cast<uint8_t *>(completeWfaSsi);
    nanPublishConfig.ssi_len            = static_cast<uint16_t>(wfaSsiSize);
    nanPublishConfig.ttl                = CHIP_DEVICE_CONFIG_WIFIPAF_DISCOVERY_TIMEOUT_SECS;
    nanPublishConfig.usd_discovery_flag = 1;                                     // Enable USD
    nanPublishConfig.usd_publish_config = esp_wifi_usd_get_default_publish_cfg();
    nanPublishConfig.usd_publish_config.usd_default_channel = 6;

    uint32_t publish_id = esp_wifi_nan_publish_service(&nanPublishConfig, 0);

    // Free memory allocated for WFA SSI
    if (completeWfaSsi != nullptr)
    {
        chip::Platform::MemoryFree(completeWfaSsi);
        completeWfaSsi = nullptr;
    }

